# LoadedFamilyIntegrityCheck Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
LoadedFamilyIntegrityCheck Class
Members See Also
---
Functions for checking the integrity of loaded families.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class LoadedFamilyIntegrityCheck
```

Visual Basic
---
```text
Public NotInheritable Class LoadedFamilyIntegrityCheck
```

Visual C++
---
```text
public ref class LoadedFamilyIntegrityCheck abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..LoadedFamilyIntegrityCheck
# See Also
LoadedFamilyIntegrityCheck Members
Autodesk.Revit.DB Namespace